Tekla Open API Reference for Tekla Structures 2025
Picker Methods
Methods
Name | Description
PickFace()
 Queries the user to pick a face from the model.
PickFace(String)
 Queries the user to pick a face from the model with the given prompt.
PickLine()
 Queries the user to pick a line from the model.
PickLine(String)
 Queries the user to pick a line from the model with the given prompt.
PickObject(Picker.PickObjectEnum)
 Queries the user to pick one model object from the model.
PickObject(Picker.PickObjectEnum, String)
 Queries the user to pick one model object from the model with the given prompt.
PickObjects(Picker.PickObjectsEnum)
 Queries the user to pick model objects from the model.
PickObjects(Picker.PickObjectsEnum, String)
 Queries the user to pick model objects from the model with the given prompt.
PickPoint()
 Queries the user to pick a point from the model.
PickPoint(String)
 Queries the user to pick a point from the model with the given prompt.
PickPoint(Point)
 Queries the user to pick a point from the model with reference to the given point.
PickPoint(String, Point)
 Queries the user to pick point with given prompt and reference to another point.
PickPoints(Picker.PickPointEnum)
 Queries the user to pick points from the model.
PickPoints(Picker.PickPointEnum, String)
 Queries the user to pick points from the model with the given prompt and reference to another point.
Top
See Also
Reference
Picker Class
Tekla.Structures.Model.UI Namespace